In [4]:
import pandas as pd
import numpy as np

In [5]:
data = {
    'Player': ['Barry Bonds', 'Hank Aaron', 'Babe Ruth', 'Alex Rodriguez', 'Albert Pujols',
        'Willie Mays', 'Ken Griffey Jr.'],
    'HR': [762, 755, 714, 696, 703, 660, np.nan], #630 replace by nan
    'Team': ['Giants', 'Braves', 'Yankes', 'Yanks', 'Cardinals', 'New York Giants', 'Mariners']
}

In [6]:
df = pd.DataFrame(data)

In [7]:
df

            Player     HR             Team
0      Barry Bonds  762.0           Giants
1       Hank Aaron  755.0           Braves
2        Babe Ruth  714.0           Yankes
3   Alex Rodriguez  696.0            Yanks
4    Albert Pujols  703.0        Cardinals
5      Willie Mays  660.0  New York Giants
6  Ken Griffey Jr.    NaN         Mariners

In [8]:
# Example 1 single value
df['Team'] = df['Team'].replace('Braves', 'Atlanta Braves')

In [10]:
df

            Player     HR             Team
0      Barry Bonds  762.0           Giants
1       Hank Aaron  755.0   Atlanta Braves
2        Babe Ruth  714.0           Yankes
3   Alex Rodriguez  696.0            Yanks
4    Albert Pujols  703.0        Cardinals
5      Willie Mays  660.0  New York Giants
6  Ken Griffey Jr.    NaN         Mariners

In [11]:
# Example 2: replace multiple values with one value
df['Team'] = df['Team'].replace(['Yankes', 'Yanks'], 'New York Yankees')

In [ ]:
# Example 3: Multiple values
df['Team'] = df['Team'].replace({
  'Giants': 'San Fransisco Giants',
  'Mariners': 'Seattle Mariners'
})

In [13]:
df

            Player     HR                  Team
0      Barry Bonds  762.0  San Fransisco Giants
1       Hank Aaron  755.0        Atlanta Braves
2        Babe Ruth  714.0      New York Yankees
3   Alex Rodriguez  696.0      New York Yankees
4    Albert Pujols  703.0             Cardinals
5      Willie Mays  660.0       New York Giants
6  Ken Griffey Jr.    NaN      Seattle Mariners

In [14]:
# Example 4: multiple values - list
df['Team'] = df['Team'].replace(
  ['San Fransisco Giants', 'Atlanta Braves'], 
  ['SF Giants', 'ATL Braves']
)

In [15]:
df

            Player     HR              Team
0      Barry Bonds  762.0         SF Giants
1       Hank Aaron  755.0        ATL Braves
2        Babe Ruth  714.0  New York Yankees
3   Alex Rodriguez  696.0  New York Yankees
4    Albert Pujols  703.0         Cardinals
5      Willie Mays  660.0   New York Giants
6  Ken Griffey Jr.    NaN  Seattle Mariners

In [16]:
# Example 5: entire dataframe
data2 = {
    'team_one_city': ['Los Angeles'],
    'team_two_city': ['Los Angeles']
}

In [17]:
df2 = pd.DataFrame(data2)

In [18]:
df2

  team_one_city team_two_city
0   Los Angeles   Los Angeles

In [19]:
df2.replace('Los Angeles', 'LA')

  team_one_city team_two_city
0            LA            LA

In [20]:
# Example 6: replace using regex
data3 = {
    'team_one_city': ['Los Angeles Angeles'],
    'team_two_city': ['Los Angeles Dodgers']  
}

In [21]:
df3 = pd.DataFrame(data3)

In [22]:
df3.replace('Los Angeles', 'LA', regex=True)

  team_one_city team_two_city
0    LA Angeles    LA Dodgers

In [23]:
# Example 7: Replace $ using regex
data4 = {
    'Card Name': ['Ken Griffey Jr.', 'Derek Jeter', 'Mike Trout', 'Babe Ruth'],
    'Sold Price': ['$1,200.00', '$3,500.50', '$2,000.00', '$10,000.00']
}

In [24]:
sales_df = pd.DataFrame(data4)

In [25]:
sales_df

         Card Name  Sold Price
0  Ken Griffey Jr.   $1,200.00
1      Derek Jeter   $3,500.50
2       Mike Trout   $2,000.00
3        Babe Ruth  $10,000.00

In [32]:
sales_df['Sold Price'] = sales_df['Sold Price'].replace('[$,]', '', regex=True)

In [33]:
sales_df

         Card Name Sold Price
0  Ken Griffey Jr.    1200.00
1      Derek Jeter    3500.50
2       Mike Trout    2000.00
3        Babe Ruth   10000.00